Revit 2026 API

# FabricationPartServiceId Property

---

The fabrication part service identifier. The service can only be changed to compatible services.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int ServiceId { get; set; }
```
```vb
Public Property ServiceId As Integer
	Get
	Set
```
```cpp
public:
property int ServiceId {
	int get ();
	void set (int value);
}
```
```fsharp
member ServiceId : int with get, set
```

#### Property Value

Int32

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: |

#### Reference

FabricationPart Class

Autodesk.Revit.DB Namespace